1Cvgnqualitysmoke/src/DataProcessors/ЗагрузкаДанныхРасширений/ЗагрузкаДанныхРасширений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаДанныхРасширений</name>
</mdclass:DataProcessor>

1Cvgnqualitysmoke/src/Enums/ТипыИзменений/ТипыИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИзменений</name>
  <enumValues>
    <name>ОбъектИзменен</name>
  </enumValues>
  <enumValues>
    <name>ОбъектПрисутствуетТолькоВОсновнойКонфигурации</name>
  </enumValues>
  <enumValues>
    <name>ОбъектПрисутствуетТолькоВКонфигурацииПоставщика</name>
  </enumValues>
</mdclass:Enum>

1Cvgnqualitysmoke/src/Catalogs/ОписаниеИзменений/ОписаниеИзменений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОписаниеИзменений</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияИсточник</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонфигурацияПриемник</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзменения</name>
    <type>
      <types>EnumRef.ТипыИзменений</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаМетаданных</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ГруппаМетаданных</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Метаданные</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКонтуре</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноПрограммистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноКонсультантом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПровереноКлиентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПрограмист</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКонсультант</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МетаданныеБезПрефикса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФункциональныйУчасток</name>
    <type>
      <types>CatalogRef.ФункциональныеУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВопросКонсультанту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВопросЗаказчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимаДоработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеобходимоРазделениеФункциональности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статистика</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеРасширения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОписаниеСвойств</name>
    <attributes>
      <name>СвойствоМетаданных</name>
      <type>
        <types>CatalogRef.СвойстваМетаданных</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойствМетаданных</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствМетаданных</types>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипИзменения</name>
      <type>
        <types>EnumRef.ТипыИзменений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеОбъекты</name>
    <attributes>
      <name>СвязанныйОбъект</name>
      <type>
        <types>CatalogRef.Подсистемы</types>
        <types>CatalogRef.ОписаниеИзменений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1Cvgnqualitysmoke/src/DataProcessors/ЗагрузкаДанныхРасширений/Forms/Форма/Module.bsl
&НаСервереБезКонтекста
Процедура ЗагрузитьНаСервере(АдресСравненияФайлов, Организация, КонфигурацияИсточник, КонфигурацияПриемник) 
	
	// Выгрузка данных
	
	ФайлПриемник = ПолучитьИмяВременногоФайла("txt");
	ДанныеХранилища = ПолучитьИзВременногоХранилища(АдресСравненияФайлов);
	ДанныеХранилища.Записать(ФайлПриемник);  
		
	КэшКоличестваПробелов = Новый Соответствие;
	
	Текст = Новый ЧтениеТекста(ФайлПриемник);  
	
	Стр = Текст.ПрочитатьСтроку();
	
	СтрТекущегоОбъектаМетаданных =  Неопределено; 

	СтрокаИзменений = "";
	ЗаписаныСвойства = Ложь;
	КоличествоИзменений = 0;
	ШапкаФайла = Истина;
	СтрокаОписание = "";
	ЭтоОписание = Ложь;
	НаименованиеРасширения = "";
	
	Пока Стр <> Неопределено Цикл 
		
		Стр = Текст.ПрочитатьСтроку();
		
		Если НаименованиеРасширения = "" И СтрНачинаетсяС(Стр,"		Имя: ") Тогда 
			НаименованиеРасширения = СтрЗаменить(Стр,"		Имя: ","");		
		КонецЕсли; 
		
		КоличествоЛидирующихПробелов = ОписаниеСвойствЗаполнение.ВернутьКоличествоЛидирующихПробелов(Стр, КэшКоличестваПробелов); 
		
		Если КоличествоЛидирующихПробелов = 2 И СтрНачинаетсяС(СокрЛ(Стр),"-") Тогда // это новый объектМетаданных  
			
			//Если НЕ СтрТекущегоОбъектаМетаданных = Неопределено Тогда
			ШапкаФайла = Ложь;
			//КонецЕсли;  
			
			Если НЕ СтруктураПустая(СтрТекущегоОбъектаМетаданных) Тогда
				СоздатьОписаниеИзменений(НаименованиеРасширения, СтрТекущегоОбъектаМетаданных, СтрокаИзменений, Организация, КонфигурацияИсточник, КонфигурацияПриемник);
				КоличествоИзменений = КоличествоИзменений + 1;
			КонецЕсли;
			СтрТекущегоОбъектаМетаданных = ПолучитьСтруктуруТекущегоОбъектаМетаданных(Стр);
		Продолжить;
			
		КонецЕсли; 
		
		Если НЕ ШапкаФайла Тогда
			СтрокаИзменений = СтрокаИзменений  + ?(ПустаяСтрока(СтрокаИзменений),"",Символы.ПС) + Стр;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ СтруктураПустая(СтрТекущегоОбъектаМетаданных) Тогда
		СоздатьОписаниеИзменений(НаименованиеРасширения, СтрТекущегоОбъектаМетаданных, СтрокаИзменений, Организация, КонфигурацияИсточник, КонфигурацияПриемник);
		КоличествоИзменений = КоличествоИзменений + 1;
	КонецЕсли;
	
	Сообщить("Обработано " + КоличествоИзменений + " изменений!");
	
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура СоздатьОписаниеИзменений(НаименованиеРасширения, СтрТекущегоОбъектаМетаданных, СтрокаИзменений, Организация, КонфигурацияИсточник, КонфигурацияПриемник)
	
	НовСпр = Справочники.ОписаниеИзменений.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовСпр, СтрТекущегоОбъектаМетаданных);
	НовСпр.ДатаЗагрузки = ТекущаяДатаСеанса(); 
	НовСпр.НаименованиеРасширения = НаименованиеРасширения;
	НовСпр.Организация =  Организация;
	НовСпр.КонфигурацияИсточник = КонфигурацияИсточник;
	НовСпр.КонфигурацияПриемник = КонфигурацияПриемник; 
	НовСпр.Расширение = Истина;	
	НовСпр.Описание = СтрокаИзменений;
	НовСпр.Наименование =  "Расширение " + НаименованиеРасширения 
							+ " - " +  СтрТекущегоОбъектаМетаданных.Метаданные;
	//НовСпр.Записать();
	//ОписаниеСвойствЗаполнение.ЗаполнитьЗначенияСвойствТЧОписаниеСвойств(НовСпр); // заполнение ТЧ ОписаниеСвойств
	СтрокаИзменений = "";
	НовСпр.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруТекущегоОбъектаМетаданных(Стр)
	
	СтруктураОбъекта =  Новый Структура("ТипИзменения, ГруппаМетаданных, Метаданные, СвойствоМетаданных, ЗначениеСвойствМетаданных");
	
	Стр = Прав(Стр, СтрДлина(Стр) - 2);
	Если НЕ СтрНайти (Стр,"-") = 0 Тогда
		СтруктураОбъекта.Вставить("ТипИзменения", Перечисления.ТипыИзменений.ОбъектПрисутствуетТолькоВОсновнойКонфигурации);
		Стр = СтрЗаменить(Стр, "-" ,"");
	КонецЕсли;
	
	Стр = СтрЗаменить(Стр, "-", "");
	Массив = СтрРазделить(Стр, ".");
	
	Если Массив.Количество() = 2 Тогда
		СтруктураОбъекта.Вставить("ГруппаМетаданных",ПолучитьГруппуМетаданныхЕдЧ(СокрЛП(Массив[0])));
		СтруктураОбъекта.Вставить("Метаданные", СокрЛП(Массив[1])); 		
	ИначеЕсли  Массив.Количество() = 3 Тогда  
		СтруктураОбъекта.Вставить("ГруппаМетаданных", ПолучитьГруппуМетаданныхЕдЧ(СокрЛП(Массив[0])));
		СтруктураОбъекта.Вставить("Метаданные", СокрЛП(Массив[1])); 	
		СтруктураОбъекта.Вставить("СвойствоМетаданных", СокрЛП(Массив[2])); 
	ИначеЕсли Массив.Количество() = 4 Тогда 
		СтруктураОбъекта.Вставить("ГруппаМетаданных", ПолучитьГруппуМетаданныхЕдЧ(СокрЛП(Массив[0])));
		СтруктураОбъекта.Вставить("Метаданные", СокрЛП(Массив[1])); 	
		СтруктураОбъекта.Вставить("СвойствоМетаданных", СокрЛП(Массив[2]));
		СтруктураОбъекта.Вставить("ЗначениеСвойствМетаданных", СокрЛП(Массив[3])); 
	Иначе
		
		//Сообщить("Ошибка в определении метаданных");
	КонецЕсли;
	
	Возврат СтруктураОбъекта;
	
КонецФункции // ()

&НаСервереБезКонтекста
Функция СтруктураПустая(СтрТекущегоОбъектаМетаданных)
	Если СтрТекущегоОбъектаМетаданных = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	Для Каждого Стр Из СтрТекущегоОбъектаМетаданных Цикл
		Если ТипЗнч(Стр) = Тип("Структура") Тогда
			Если НЕ СтруктураПустая(Стр) Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Если ЗначениеЗаполнено(Стр.Значение) Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьГруппуМетаданныхЕдЧ(ГруппаМетаданныхМнЧ)
	
		ГруппаМетаданныхЕдЧ = ГруппаМетаданныхМнЧ;
		
		Если ГруппаМетаданныхМнЧ = "WebСервисы" Тогда
			ГруппаМетаданныхЕдЧ = "WebСервис";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ГруппыКоманд" Тогда
			ГруппаМетаданныхЕдЧ = "ГруппаКоманд";
		ИначеЕсли ГруппаМетаданныхМнЧ = "Документы" Тогда
			ГруппаМетаданныхЕдЧ = "Документ";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ЖурналыДокументов" Тогда
			ГруппаМетаданныхЕдЧ = "ЖурналДокументов";
		ИначеЕсли ГруппаМетаданныхМнЧ = "Константы" Тогда
			ГруппаМетаданныхЕдЧ = "Константа";
		ИначеЕсли ГруппаМетаданныхМнЧ = "Обработки" Тогда
			ГруппаМетаданныхЕдЧ = "Обработка";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ОбщиеКартинки" Тогда
			ГруппаМетаданныхЕдЧ = "ОбщаяКартинка";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ОбщиеКоманды" Тогда
			ГруппаМетаданныхЕдЧ = "ОбщаяКоманда";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ОбщиеМакеты" Тогда
			ГруппаМетаданныхЕдЧ = "ОбщийМакет";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ОбщиеМодули" Тогда
			ГруппаМетаданныхЕдЧ = "ОбщийМодуль";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ОбщиеФормы" Тогда
			ГруппаМетаданныхЕдЧ = "ОбщаяФорма";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ОпределяемыеТипы" Тогда
			ГруппаМетаданныхЕдЧ = "ОпределяемыйТип";
		ИначеЕсли ГруппаМетаданныхМнЧ = "Отчеты" Тогда
			ГруппаМетаданныхЕдЧ = "Отчет";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ПараметрыСеанса" Тогда
			ГруппаМетаданныхЕдЧ = "ПараметрСеанса";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ПараметрыФункциональныхОпций" Тогда
			ГруппаМетаданныхЕдЧ = "ПараметрФункциональныхОпций"; 
		ИначеЕсли ГруппаМетаданныхМнЧ = "Перечисления" Тогда
			ГруппаМетаданныхЕдЧ = "Перечисление";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ПланыВидовХарактеристик" Тогда
			ГруппаМетаданныхЕдЧ = "ПланВидовХарактеристик";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ПланыОбмена" Тогда
			ГруппаМетаданныхЕдЧ = "ПланОбмена";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ПланыСчетов" Тогда
			ГруппаМетаданныхЕдЧ = "ПланСчетов";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ПодпискиНаСобытия" Тогда
			ГруппаМетаданныхЕдЧ = "ПодпискаНаСобытие";
		ИначеЕсли ГруппаМетаданныхМнЧ = "Подсистемы" Тогда
			ГруппаМетаданныхЕдЧ = "Подсистема";
		ИначеЕсли ГруппаМетаданныхМнЧ = "РегистрыБухгалтерии" Тогда
			ГруппаМетаданныхЕдЧ = "РегистрБухгалтерии";
		ИначеЕсли ГруппаМетаданныхМнЧ = "РегистрыНакопления" Тогда
			ГруппаМетаданныхЕдЧ = "РегистрНакопления";
		ИначеЕсли ГруппаМетаданныхМнЧ = "РегистрыСведений" Тогда
			ГруппаМетаданныхЕдЧ = "РегистрСведений";
		ИначеЕсли ГруппаМетаданныхМнЧ = "Роли" Тогда
			ГруппаМетаданныхЕдЧ = "Роль";
		ИначеЕсли ГруппаМетаданныхМнЧ = "Справочники" Тогда
			ГруппаМетаданныхЕдЧ = "Справочник";
		ИначеЕсли ГруппаМетаданныхМнЧ = "ФункциональныеОпции" Тогда
			ГруппаМетаданныхЕдЧ = "ФункциональнаяОпция";  
		ИначеЕсли ГруппаМетаданныхМнЧ = "ЭлементыСтиля" Тогда
			ГруппаМетаданныхЕдЧ = "ЭлементСтиля";
		ИначеЕсли ГруппаМетаданныхМнЧ = "Языки" Тогда
			ГруппаМетаданныхЕдЧ = "Язык";
		КонецЕсли;	 
		
Возврат ГруппаМетаданныхЕдЧ;

КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(ПутьКФайлу) Тогда 
		АдресСравненияФайлов = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПутьКФайлу));
		ЗагрузитьНаСервере(АдресСравненияФайлов, Организация, КонфигурацияИсточник, КонфигурацияПриемник);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытия.Каталог = ПутьКФайлу;
	ДиалогОткрытия.Заголовок = "Укажите файл сравнения"; 
	
	Параметр = "";
	Оповещение = Новый ОписаниеОповещения("ВыборВнешнегоФайла_Завершение", ЭтаФорма, Параметр );
	ДиалогОткрытия.Показать(Оповещение); 

КонецПроцедуры

&НаКлиенте
Процедура ВыборВнешнегоФайла_Завершение(Результат, Параметр) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		ПутьКФайлу = Результат[0];
	КонецЕсли;
	
КонецПроцедуры
